app/controllers/booking_links_controller.rb

INSERT INTO "booking_links" ("user_id", "slug", "service_name", "price_cents", "deposit_cents", "created_at", "updated_at") VALUES (1, '9uqd8wyy', 'New Link', 3000, 500, '2026-04-17 14:57:33.409124', '2026-04-17 14:57:33.409124') RETURNING "id"
---
  def create
    p = booking_link_params
    attrs = {
      service_name:  p[:service_name],
      deposit_cents: (p[:deposit_dollars].to_f * 100).round,
      price_cents:   p[:price_dollars].present? ? (p[:price_dollars].to_f * 100).round : nil
    }
    @booking_link = current_user.booking_links.build(attrs)
    if @booking_link.save