app/controllers/bookings_controller.rb

SELECT "booking_links".* FROM "booking_links" WHERE "booking_links"."slug" = 'bp1n3fie' LIMIT 1
INSERT INTO "payments" ("booking_link_id", "stripe_payment_intent_id", "amount_cents", "status", "customer_email", "refunded_at", "created_at", "updated_at") VALUES (6, 'pi_3ToPEIPgKBhATD2v1VVzxLnS', 5000, 'paid', 'tyler.riehl16@gmail.com', NULL, '2026-07-01 14:35:13.560445', '2026-07-01 14:35:13.560445') RETURNING "id"
SELECT "payments".* FROM "payments" WHERE "payments"."stripe_payment_intent_id" = 'pi_3ToPEIPgKBhATD2v1VVzxLnS' LIMIT 1
---
  def success
    @booking_link = BookingLink.find_by(slug: params[:slug])
    return unless @booking_link && params[:session_id].present?

    stripe_session = Stripe::Checkout::Session.retrieve(
      params[:session_id],
      { stripe_account: @booking_link.user.stripe_account_id }
    )

    if stripe_session.payment_status == "paid"
      Payment.find_or_create_by!(stripe_payment_intent_id: stripe_session.payment_intent) do |p|

SELECT "booking_links".* FROM "booking_links" WHERE "booking_links"."slug" = 'tsszwgen' LIMIT 1
---
  def find_booking_link!
    booking_link = BookingLink.find_by!(slug: params[:slug])