app/controllers/dashboard_controller.rb

SELECT "booking_links".* FROM "booking_links" WHERE "booking_links"."user_id" = 1 ORDER BY "booking_links"."created_at" DESC
SELECT "payments".* FROM "payments" INNER JOIN "booking_links" ON "booking_links"."id" = "payments"."booking_link_id" WHERE "booking_links"."user_id" = 1 ORDER BY "payments"."created_at" DESC
---
  def index
    @booking_links = current_user.booking_links.order(created_at: :desc)
    @payments = Payment.includes(:booking_link)
                       .joins(:booking_link)
                       .where(booking_links: { user_id: current_user.id })
                       .order(created_at: :desc)