app/controllers/payments_controller.rb

  def refund
    @payment = Payment.joins(:booking_link)
                      .where(booking_links: { user_id: current_user.id })
                      .find(params[:id])

    unless @payment.refundable?
      redirect_to dashboard_path, alert: "Payment cannot be refunded."
      return
    end

    stripe_account = @payment.booking_link.user.stripe_account_id

    Stripe::Refund.create(
      { payment_intent: @payment.stripe_payment_intent_id, refund_application_fee: true },
      { stripe_account: stripe_account }
    )

    @payment.update!(status: "refunded", refunded_at: Time.current)
---
SELECT "payments".* FROM "payments" INNER JOIN "booking_links" ON "booking_links"."id" = "payments"."booking_link_id" WHERE "booking_links"."user_id" = 1 AND "payments"."id" = 1 LIMIT 1
UPDATE "payments" SET "status" = 'refunded', "refunded_at" = '2026-04-17 15:02:24.791347', "updated_at" = '2026-04-17 15:02:24.791580' WHERE "payments"."id" = 1