app/controllers/stripe_connect_controller.rb

UPDATE "users" SET "stripe_account_id" = 'acct_1ToPBIPgKBhATD2v', "updated_at" = '2026-07-01 14:34:36.569512' WHERE "users"."id" = 2
---
  def onboarding_return
    account_id = session.delete(:pending_stripe_account_id) || current_user.stripe_account_id

    unless account_id
      redirect_to dashboard_path, alert: "Something went wrong. Please try connecting again."
      return
    end

    account = Stripe::Account.retrieve(account_id)

    if account.charges_enabled
      current_user.update!(stripe_account_id: account_id)